src/Test scripts/stresstest.yml
config:
  target: 'https://qz6cpfp4d5qpuewayidlmchgfi0rwifk.lambda-url.us-east-1.on.aws/'
  phases:
    - duration: 600
      arrivalRate: 10
      rampTo: 50
      name: stress testing
scenarios:
  - flow:
      - post:
          url: "/api/books"
          json:
            key: value